"""
Додати перевірку введеної IP-адреси. Адреса вважається коректно заданою, якщо вона:
складається з 4 чисел (а не літер чи інших символів)числа розділені точкою
кожне число в діапазоні від 0 до 255 Якщо адреса неправильна, виводьте повідомлення: «Неправильна IP-адреса».
Повідомлення "Неправильна IP-адреса" має виводитися лише один раз, навіть якщо кілька пунктів вище не виконані.
"""

ip = input("Введіть IP адресу ")
splitted_address = ip.split(".")

if len(ip) == 4 \
        and all(isinstance(num, int) for num in splitted_address) \
        and all(num>=0 and num<=255 for num in splitted_address):
    print(ip)
else:
    print("Неправильна IP-адреса")
