"""
Напишіть інтерактивний калькулятор. Передбачається, що користувач вводить формулу, що складається з
числа, оператора (як мінімум * і /) та іншого числа, розділених пробілом (наприклад, 2 * 5).

 - Якщо вхідні дані не складаються з трьох елементів, генеруйте та спіймайте власний ексепшн FormulaError.
 - Якщо другий елемент не є «*» або «/», генеруйте та спіймайте власний ексепшн WrongOperatorError
 - Якщо введені числа не можуть бути float спіймайте ValueError
 - Також ловіть помилку при діленні на 0
 - В кожній спійманій помилці друкуйте пояснення, що пішло не так
 - За допомогою циклів (while + counter) або (for + in range) надайте три спроби скористуватись калькулятором,
якщо введені не вірні дані
 - Використати всі блоки try, except, else, finally. В finally можна надрукувати за скільки спроб виконавлась формула
 - Результат виконання формули - float число з двома знаками після крапки
"""

first_number = float(input("Введіть перше число: "))
second_number = float(input("Введіть друге число: "))

print("""
Виберіть операцію зі списку:
1. Множення
2. Ділення
""")

operation = int(input("Введіть операцію (* або /): "))

if operation == '*':
        print("Дорівнює: {} * {} = {}".format(first_number,second_number,first_number*second_number))

elif operation == '/':
        try:
            print("Дорівнює: {} / {} = {}".format(first_number,second_number,first_number/second_number))
        except:
            print("На нуль ділити не можна!")
else:
        print("Невірна операція!")