"""
Створіть декоратор, який виводить в консоль назву викликаної функції. Наприклад, створіть пару функцій для арифметичних
 операцій підсумовування та множення. Під час виклику цих функцій має бути повернутий результат операції, а ім’я
 викликаної функції має відображатися на консолі разом із результатом. Маленька підказка (__name__)
"""


def my_decorator(func):
    def wrapper():
        func.__name__

    return wrapper


@my_decorator
def sum_of_two(a, b):
    result = a + b
    return result


if __name__ == '__main__':
    sum_of_two(3, 5)




